Quest 3. Recursive
> Программа разработана

46 49 42 4F 4E 41 43 43 49 32 31
> Применить разработанную программу для декодирования вывода резервного модуля

Ты расшифровываешь послание. Похоже на ребус. По всей видимости, стоит разработать небольшую программу для его решения. Результат вычислений эта программа должна выдавать в stdout. Не забудь разместить ее в src/quest3.c.

Получен Quest 3. Создать программу src/quest3.c, которая рассчитывает и выводит на экран n-ое число Фибоначчи при помощи рекурсивного алгоритма. Сам поиск n-ого числа Фибоначчи должен быть выделен в отдельную функцию. Число вводится через стандартный поток ввода. В случае ошибки выводить «n/a».
Входные данные	Выходные данные
21	10946
